<script lang="ts" setup>
    const { currentlyMobile } = mobileState();

    const isScrolled = ref(false);

    const handleScroll = () => {
        isScrolled.value = window.scrollY > 1
    }

    onMounted(() => {
        window.addEventListener('scroll', handleScroll)
        handleScroll()
    })

    onUnmounted(() => {
        window.removeEventListener('scroll', handleScroll)
    })
</script>

<template>
    <header>
        <div class="header">
            <div class="header__container"
            :class="{ 'scrolled': isScrolled }">
                <a href="/" class="header__logo">
                    <img src="/images/Logo.png" alt="header-logo">
                </a>
                <nav class="header__nav"
                v-if="!currentlyMobile">
                    <ul>
                        <li><a href="/assortment">Ассортимент</a></li>
                        <li><a href="/mission">Доставка</a></li>
                        <li><a href="/#reviews">Отзывы</a></li>
                        <li><a href="/about">О нас</a></li>
                        <li><a href="/news">Новости</a></li>
                    </ul>
                </nav>
                <div class="header__button-block"
                v-if="!currentlyMobile">
                    <div class="header__button-block__callback-block">
                        <div class="header__button-block__callback-block__icon">
                            <svg width="53" height="53" viewBox="0 0 53 53" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <circle cx="26.5" cy="26.5" r="26.5" fill="#CCBA4B"/>
                                <path d="M13 16.75C13 29.5906 23.4094 40 36.25 40C36.8293 40 37.4037 39.9788 37.9725 39.9371C38.6251 39.8893 38.9514 39.8655 39.2485 39.6945C39.4945 39.5529 39.7277 39.3018 39.851 39.046C40 38.7373 40 38.3771 40 37.657V33.4311C40 32.8254 40 32.5225 39.9003 32.263C39.8124 32.0337 39.6692 31.8295 39.4838 31.6684C39.274 31.486 38.9893 31.3825 38.4202 31.1755L33.61 29.4264C32.9477 29.1856 32.6166 29.0651 32.3025 29.0855C32.0254 29.1035 31.7589 29.1982 31.5324 29.3587C31.2756 29.5406 31.0944 29.8428 30.7318 30.4471L29.5 32.5C25.5252 30.6999 22.3029 27.4734 20.5 23.5L22.5529 22.2682C23.1572 21.9057 23.4593 21.7244 23.6413 21.4676C23.8018 21.2411 23.8965 20.9746 23.9145 20.6975C23.9349 20.3834 23.8144 20.0523 23.5736 19.3901L21.8245 14.5798C21.6175 14.0106 21.514 13.726 21.3316 13.5161C21.1705 13.3307 20.9663 13.1877 20.737 13.0997C20.4774 13 20.1746 13 19.569 13H15.343C14.6228 13 14.2627 13 13.954 13.1489C13.6982 13.2722 13.4472 13.5055 13.3056 13.7515C13.1345 14.0486 13.1106 14.3749 13.0628 15.0276C13.0212 15.5963 13 16.1707 13 16.75Z" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>
                        </div>
                        <div class="header__button-block__callback-block__title">
                            <span>Позвони нам:</span>
                            +7 (987) 458-54-20
                        </div>
                    </div>
                    <Button color="outline"
                    link="/cart">
                        Корзина
                    </Button>
                </div>
                <div class="header__burger-button"
                v-if="currentlyMobile">
                    <svg width="41" height="61" viewBox="0 0 41 61" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M35.7898 16.3745C34.8893 16.3746 33.8713 16.9326 33.4272 17.7255C33.1923 18.1452 32.8135 18.5581 32.3368 18.5581L8.66332 18.557C8.18655 18.557 7.8078 18.1442 7.57285 17.7244C7.12882 16.9315 6.11078 16.3735 5.21029 16.3735C4.01833 16.3735 3.05212 17.3511 3.05213 18.557C3.05215 19.7629 4.01839 20.7405 5.21028 20.7405C4.01839 20.7405 3.05211 21.6077 3.05213 22.8529C3.05214 24.0981 4.01838 25.1075 5.21028 25.1076C6.11078 25.1076 7.12885 24.5313 7.57285 23.7126C7.80779 23.2792 8.18654 22.8529 8.66332 22.8529L32.3368 22.854C32.8135 22.854 33.1923 23.2803 33.4272 23.7137C33.8712 24.5324 34.8893 25.1087 35.7898 25.1087C36.9817 25.1086 37.9479 24.0992 37.9479 22.854C37.948 21.6088 36.9817 20.7416 35.7898 20.7416C36.9817 20.7416 37.9479 19.764 37.9479 18.5581C37.948 17.3522 36.9817 16.3746 35.7898 16.3745Z" fill="white"/>
                        <path d="M35.7897 26.1236C34.8892 26.1236 33.8712 26.6817 33.4272 27.4745C33.1922 27.8943 32.8135 28.3071 32.3367 28.3071L8.66328 28.3061C8.18651 28.3061 7.80776 27.8932 7.57281 27.4735C7.12878 26.6806 6.11074 26.1225 5.21025 26.1225C4.01829 26.1226 3.05208 27.1002 3.05209 28.3061C3.05211 29.512 4.01835 30.4896 5.21024 30.4896C4.01835 30.4896 3.05207 31.4672 3.05209 32.6731C3.05211 33.879 4.01834 34.8566 5.21024 34.8567C6.11074 34.8567 7.12881 34.2986 7.57281 33.5058C7.80775 33.086 8.1865 32.6731 8.66328 32.6731L32.3367 32.6742C32.8135 32.6742 33.1923 33.0871 33.4272 33.5068C33.8712 34.2997 34.8893 34.8577 35.7898 34.8577C36.9817 34.8577 37.9479 33.8801 37.9479 32.6742C37.9479 31.4683 36.9816 30.4906 35.7898 30.4907C36.9816 30.4906 37.9479 29.513 37.9479 28.3071C37.9479 27.1012 36.9817 26.1236 35.7897 26.1236Z" fill="white"/>
                        <path d="M35.7897 35.8921C34.8892 35.8922 33.8712 36.4502 33.4272 37.2431C33.1922 37.6628 32.8135 38.0757 32.3367 38.0757L8.66328 38.0746C8.18651 38.0746 7.80776 37.6618 7.57281 37.242C7.12878 36.4491 6.11074 35.8911 5.21025 35.8911C4.01829 35.8911 3.05208 36.8687 3.05209 38.0746C3.05211 39.2805 4.01835 40.2581 5.21024 40.2581C4.01835 40.2581 3.05207 41.2358 3.05209 42.4417C3.05211 43.6476 4.01834 44.6252 5.21024 44.6252C6.11074 44.6252 7.12881 44.0672 7.57281 43.2743C7.80775 42.8546 8.1865 42.4417 8.66328 42.4417L32.3367 42.4428C32.8135 42.4428 33.1923 42.8556 33.4272 43.2754C33.8712 44.0682 34.8893 44.6263 35.7898 44.6263C36.9817 44.6263 37.9479 43.6487 37.9479 42.4427C37.9479 41.2368 36.9816 40.2592 35.7898 40.2592C36.9816 40.2592 37.9479 39.2816 37.9479 38.0757C37.9479 36.8698 36.9817 35.8922 35.7897 35.8921Z" fill="white"/>
                    </svg>
                </div>
            </div>
        </div>
    </header>
</template>

<style lang="scss">
    header {
        margin-top: 2.5rem;
        position: fixed;
        top: 0;
        left: 0;
        .header {
            &__container {
                margin: 0 11.25rem;
                padding: 0 4.375rem;
                @include df_jb_ac;
                @include transition(background-color);
                @include mobile {
                    margin: 0;
                    padding: 0 16px;
                }
                &.scrolled {
                    background-color: #1E1E1E4D;
                }
            }
            &__logo {
                width: 7.8125rem;
                height: 5.0625rem;
                img {
                    @include image_cover;
                }
            }
            &__nav {
                ul {
                    @include df_ac;
                    gap: 2rem;
                    li {
                        a {
                            font-size: 1.5rem;
                            @include manrope;
                            font-weight: 400;
                            color: #fff;
                        }
                    }
                }
            }
            &__button-block {
                @include df_ac;
                gap: 1.5rem;
                &__callback-block {
                    @include df_ac;
                    gap: .25rem;
                    &__icon {
                        height: 3.25rem;
                        width: 3.25rem;
                        aspect-ratio: 1 / 1;
                        svg {
                            @include wh-100;
                        }
                    }
                    &__title {
                        @include df_fdc;
                        gap: .25rem;
                        font-size: 1rem;
                        font-weight: 400;
                        @include manrope;
                        color: #fff;
                        span {
                            font-size: 1.25rem;
                            font-weight: 600;
                        }
                    }
                }
            }
            &__burger-button {
                max-height: 5.0833rem;
                aspect-ratio: 3.4167 / 5.0833;
                height: 100%;
                svg {
                    @include wh-100;
                }
            }
        }
    }
</style>