<script lang="ts" setup>
    const props = withDefaults(defineProps<{
        
    }>(),
    {
    
    })
</script>

<template>
    <Header></Header>
    <HeroSecond type="mission"
    page="Наша миссия"
    title="Наша миссия"
    desc="Мы заботимся о здоровье и счастье ваших питомцев, подбирая только качественные и безопасные товары." />

    <section>
        <div class="mission-section">
            <div class="mission-section__container">
                <div class="mission-section__title-block">
                    <div class="mission-section__title-block__title">
                        Наша миссия
                    </div>
                    <div class="mission-section__title-block__desc">
                        Наша миссия — сделать заботу о питомцах простой и доступной для каждого владельца, обеспечивая качественный корм и удобную доставку без лишних хлопот.
                    </div>
                </div>
                <div class="mission-section__info-block">
                    <div class="mission-section__info-block__image">
                        <img src="/images/mission.jpg" alt="mission-image">
                    </div>
                    <div class="mission-section__info-block__button-block">
                        <div class="mission-button">
                            <div class="mission-button__icon">
                                <svg width="27" height="23" viewBox="0 0 27 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M12.3648 3.12451C13.1191 5.3272 12.3489 7.55042 10.6451 8.09467C8.94129 8.63892 6.94734 7.29369 6.19302 5.09101C5.43869 2.88833 6.20884 0.66511 7.91266 0.120857C9.61648 -0.423396 11.6104 0.921832 12.3648 3.12451ZM5.29099 8.55164C6.28797 10.2152 6.04532 12.1509 4.75294 12.8697C3.46057 13.5885 1.60377 12.8235 0.612076 11.1599C-0.379622 9.49638 -0.142247 7.56069 1.15013 6.84186C2.4425 6.12304 4.29929 6.88807 5.29099 8.55164ZM3.6452 18.954C6.40929 11.6991 11.3203 9.85579 13.4989 9.85579C15.6774 9.85579 20.5885 11.6991 23.3526 18.954C23.5425 19.4521 23.6269 19.9861 23.6269 20.5201V20.6022C23.6269 21.9269 22.5244 23 21.1634 23C20.5568 23 19.9555 22.9281 19.3699 22.7844L14.7279 21.6548C13.9209 21.4597 13.0769 21.4597 12.2698 21.6548L7.62781 22.7844C7.04229 22.9281 6.44094 23 5.83432 23C4.47337 23 3.3709 21.9269 3.3709 20.6022V20.5201C3.3709 19.9861 3.4553 19.4521 3.6452 18.954ZM22.2448 12.8697C20.9524 12.1509 20.7098 10.2152 21.7068 8.55164C22.7037 6.88807 24.5553 6.12304 25.8476 6.84186C27.14 7.56069 27.3827 9.49638 26.3857 11.1599C25.3887 12.8235 23.5372 13.5885 22.2448 12.8697ZM16.3526 8.09467C14.6488 7.55042 13.8787 5.3272 14.633 3.12451C15.3873 0.921832 17.3813 -0.423396 19.0851 0.120857C20.7889 0.66511 21.5591 2.88833 20.8047 5.09101C20.0504 7.29369 18.0565 8.63892 16.3526 8.09467Z" fill="#181818"/>
                                </svg>
                            </div>
                            <span>Забота о здоровье животных</span>
                        </div>
                        <div class="mission-button">
                            <div class="mission-button__icon">
                                <svg width="27" height="27" viewBox="0 0 27 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M23.1429 0C25.2703 0 27 1.72969 27 3.85714V23.1429C27 25.2703 25.2703 27 23.1429 27H3.85714C1.72969 27 0 25.2703 0 23.1429V3.85714C0 1.72969 1.72969 0 3.85714 0H23.1429ZM20.6116 6.85246C19.9667 6.38237 19.0627 6.52701 18.5926 7.17188L11.3967 17.0679L8.2567 13.9279C7.69018 13.3614 6.77411 13.3614 6.21362 13.9279C5.65313 14.4944 5.6471 15.4105 6.21362 15.971L10.5529 20.3103C10.8542 20.6116 11.2701 20.7623 11.6859 20.7321C12.1018 20.702 12.4935 20.485 12.7406 20.1415L20.931 8.87143C21.4011 8.22656 21.2565 7.32254 20.6116 6.85246Z" fill="#181818"/>
                                </svg>
                            </div>
                            <span>Проверенное качество</span>
                        </div>
                        <div class="mission-button">
                            <div class="mission-button__icon">
                                <svg width="27" height="27" viewBox="0 0 27 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M13.5 25.3104C20.9566 25.3104 27 19.642 27 12.6552C27 5.66849 20.9566 0 13.5 0C6.04336 0 0 5.66849 0 12.6552C0 15.5185 1.0125 18.155 2.72109 20.2747L0.147656 25.1417C-0.105469 25.6163 -0.0263671 26.1963 0.3375 26.5918C0.701367 26.9873 1.27617 27.1085 1.7666 26.8976L8.01035 24.2242C9.6873 24.9202 11.5436 25.3104 13.5 25.3104ZM6.75 10.9679C7.6834 10.9679 8.4375 11.7219 8.4375 12.6552C8.4375 13.5885 7.6834 14.3426 6.75 14.3426C5.8166 14.3426 5.0625 13.5885 5.0625 12.6552C5.0625 11.7219 5.8166 10.9679 6.75 10.9679ZM13.5 10.9679C14.4334 10.9679 15.1875 11.7219 15.1875 12.6552C15.1875 13.5885 14.4334 14.3426 13.5 14.3426C12.5666 14.3426 11.8125 13.5885 11.8125 12.6552C11.8125 11.7219 12.5666 10.9679 13.5 10.9679ZM18.5625 12.6552C18.5625 11.7219 19.3166 10.9679 20.25 10.9679C21.1834 10.9679 21.9375 11.7219 21.9375 12.6552C21.9375 13.5885 21.1834 14.3426 20.25 14.3426C19.3166 14.3426 18.5625 13.5885 18.5625 12.6552Z" fill="#181818"/>
                                </svg>
                            </div>
                            <span>Честность и открытость</span>
                        </div>
                        <div class="mission-button">
                            <div class="mission-button__icon">
                                <svg width="27" height="22" viewBox="0 0 27 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0 2.93333C0 1.31542 1.34531 0 3 0H16.5C18.1547 0 19.5 1.31542 19.5 2.93333V4.4H21.8766C22.6734 4.4 23.4375 4.70708 24 5.25708L26.1234 7.33333C26.6859 7.88333 27 8.63042 27 9.40958V16.1333C27 17.7513 25.6547 19.0667 24 19.0667H23.8453C23.3578 20.7579 21.7641 22 19.875 22C17.9859 22 16.3969 20.7579 15.9047 19.0667H11.0953C10.6078 20.7579 9.01406 22 7.125 22C5.23594 22 3.64688 20.7579 3.15469 19.0667H3C1.34531 19.0667 0 17.7513 0 16.1333V2.93333ZM24 11.7333V9.40958L21.8766 7.33333H19.5V11.7333H24ZM9 17.9667C9 16.9538 8.16094 16.1333 7.125 16.1333C6.08906 16.1333 5.25 16.9538 5.25 17.9667C5.25 18.9796 6.08906 19.8 7.125 19.8C8.16094 19.8 9 18.9796 9 17.9667ZM19.875 19.8C20.9109 19.8 21.75 18.9796 21.75 17.9667C21.75 16.9538 20.9109 16.1333 19.875 16.1333C18.8391 16.1333 18 16.9538 18 17.9667C18 18.9796 18.8391 19.8 19.875 19.8Z" fill="#181818"/>
                                </svg>
                            </div>
                            <span>Удобство и скорость доставки</span>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>

    <section>
        <div class="order-section">
            <div class="order-section__container">
                <div class="order-section__title">
                    Соверши заказ
                </div>
                <Button color="accent"
                size="small">
                    Перейти к ассортименту
                </Button>
            </div>
        </div>
    </section>

    <Footer></Footer>
</template>

<style lang="scss">
    .mission-section {
        margin-top: 3.75rem;
        &__container {
            padding: 3.75rem 6.25rem;
            background-color: #F8F2D5;
            @include df_fdc;
            gap: 3.75rem;
        }
        &__title-block {
            @include df_fdc;
            gap: .75rem;
            max-width: 44%;
            &__title {
                @include manrope;
                font-weight: 500;
                font-size: 2.5rem;
                color: #181818;
            }
            &__desc {
                @include manrope;
                font-weight: 300;
                font-size: 1.5rem;
                color: #181818;
            }
        }
        &__info-block {
            @include df_ac;
            gap: 3rem;
            &__image {
                max-height: 15.5625rem;
                aspect-ratio: 26.5 / 15.5625;
                height: 100%;
                border-radius: .75rem;
                overflow: hidden;
                img {
                    @include image_cover;
                }
            }
            &__button-block {
                @include grid(2, .75rem);
                .mission-button {
                    padding: 2.5rem 2rem;
                    border-radius: .75rem;
                    border: 1px solid #181818;
                    box-shadow: 0px 1px 3px 0px #00000063;
                    @include df_ac;
                    gap: .5rem;
                    &__icon {
                        height: 1.6875rem;
                        width: 1.6875rem;
                        aspect-ratio: 1 / 1;
                        svg {
                            @include wh-100;
                        }
                    }
                }
            }
        }
    }

    .order-section {
        margin-top: 12.5rem;
        &__container {
            @include df_fdc_ac;
            gap: 2.625rem;
            padding: 6.25rem 0;
            background-color: #F8F2D5;
        }
        &__title {
            @include onest;
            font-weight: 700;
            font-size: 3rem;
            color: #000;
            text-align: center;
        }
    }
</style>