<script lang="ts" setup>
    const props = withDefaults(defineProps<{
        
    }>(),
    {
    
    })
</script>

<template>
    <Header></Header>
    <HeroSecond type="policy"
    page="Политика конф."
    title="Политика конфиденциальности"
    desc="Мы заботимся о здоровье и счастье ваших питомцев, подбирая только качественные и безопасные товары." />

    <section>
        <div class="policy-section">
            <div class="policy-section__container">
                <ul>
                    <li>1.1. Общие положения</li>
                    <li>1.2. Мы не осуществляем сбор ваших персональных данных с использованием Сайта.</li>
                    <li>1.3. Все данные, собираемые на Сайте, предоставляются и принимаются в обезличенной форме (далее – «Обезличенные данные»).</li>
                    <li>1.4. Обезличенные данные включают следующие сведения, которые не позволяют вас идентифицировать:</li>
                    <li>1.4.1. Информацию, которую вы предоставляете о себе самостоятельно с использованием онлайн-форм и программных модулей Сайта, включая имя и номер телефона и/или адрес электронной почты.</li>
                    <li>1.4.2. Данные, которые передаются в обезличенном виде в автоматическом режиме в зависимости от настроек используемого вами программного обеспечения.</li>
                    <li>1.5. Администрация вправе устанавливать требования к составу Обезличенных данных Пользователя, которые собираются использованием Сайта.</li>
                    <li>1.6. Если определенная информация не помечена как обязательная, ее предоставление или раскрытие осуществляется Пользователем на свое усмотрение. Одновременно вы даете информированное согласие на доступ неограниченного круга лиц к таким данным. Указанные данные становится общедоступными с момента предоставления и/или раскрытия в иной форме.</li>
                    <li>1.7. Администрация не осуществляет проверку достоверности предоставляемых данных и наличия у Пользователя необходимого согласия на их обработку в соответствии с настоящей Политикой, полагая, что Пользователь действует добросовестно, осмотрительно и прилагает все необходимые усилия к поддержанию такой информации в актуальном состоянии и получению всех необходимых согласий на ее использование.</li>
                    <li>1.8. Вы осознаете и принимаете возможность использования на Сайте программного обеспечения третьих лиц, в результате чего такие лица могут получать и передавать указанные в п.1.3 данные в обезличенном виде.</li>
                </ul>
            </div>
        </div>
    </section>

    <Footer></Footer>
</template>

<style lang="scss">
    .policy-section {
        margin-top: 3.75rem;
        &__container {
            padding: 2.5rem 8.75rem;
            background-color: #F8F2D5;
            ul {
                @include df_fdc;
                gap: 3rem;
                li {
                    @include manrope;
                    font-weight: 500;
                    font-size: 2rem;
                    color: #181818;
                }
            }
        }
    }
</style>